2021-10-03-youtube-dl.html
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="description" content="Descargar videos de youtube" />
    <link
      rel="alternate"
      type="application/rss+xml"
      href="https://martiyo.github.io/rss.xml"
      title="RSS feed for https://martiyo.github.io/"
    />
    <title>youtube-dl</title>
    <meta name="author" content="martiyo" />
    <meta name="referrer" content="no-referrer" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <link href="static/style.css" rel="stylesheet" type="text/css" />
    <link rel="icon" href="static/favicon.ico" />
  </head>
  <body>
    <div id="preamble" class="status">
      <div class="header">
        <ul>
          <li><a href="https://martiyo.github.io/">/home</a></li>
          <li><a href="https://martiyo.github.io/about">/about</a></li>
          <li><a href="https://martiyo.github.io/contact">/contact</a></li>
        </ul>
        <h1>El universo perdido de GNU/Emacs</h1>
        <blockquote>
          Este blog es una farsa son solo resumenes, traducciónes y cosas que
          encuentro por ahí.
        </blockquote>
        <form>
          <input type="text" placeholder="Search..." />
        </form>
        <br />
      </div>
    </div>
    <div id="content">
      <div class="post-date">03 oct 2021</div>
      <h1 class="post-title">
        <a href="https://martiyo.github.io/2021-10-03-youtube-dl.html"
          >youtube-dl</a
        >
      </h1>
      <p>
        Youtube-dl es un programa de línea de comandos para descargar videos de
        youtube y algunos otros sitios más
      </p>

      <div id="outline-container-orgf4edea7" class="outline-2">
        <h2 id="orgf4edea7">#Instalación</h2>
        <div class="outline-text-2" id="text-orgf4edea7">
          <p>Con curl</p>

          <pre class="example">
sudo curl -L https://yt-dl.org/downloads/latest/youtube-dl -o /usr/local/bin/youtube-dl
sudo chmod a+rx /usr/local/bin/youtube-dl
</pre
          >

          <p>Con wget</p>

          <pre class="example">
sudo wget https://yt-dl.org/downloads/latest/youtube-dl -O /usr/local/bin/youtube-dl
sudo chmod a+rx /usr/local/bin/youtube-dl
</pre
          >
        </div>
      </div>

      <div id="outline-container-orgfe305c8" class="outline-2">
        <h2 id="orgfe305c8"># Usos frecuentes</h2>
        <div class="outline-text-2" id="text-orgfe305c8">
          <ul class="org-ul">
            <li>Descargar un video o playlist:</li>
          </ul>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
youtube-dl '{{https://www.youtube.com/watch?v=oHg5SJYRHA0}}'
</pre
            >
          </div>

          <ul class="org-ul">
            <li>
              Listar todos los formatos en los que esta disponible un video y
              lista de reproducción:
            </li>
          </ul>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
youtube-dl --list-formats '{{https://www.youtube.com/watch?v=oHg5SJYRHA0}}'
</pre
            >
          </div>

          <ul class="org-ul">
            <li>Descargar un video o playlist en una calidad especifica:</li>
          </ul>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
youtube-dl --format "{{best[height&lt;=480]}}" '{{https://www.youtube.com/watch?v=oHg5SJYRHA0}}'
</pre
            >
          </div>

          <ul class="org-ul">
            <li>
              Descargar un video con formato mp4 con nombres de archivos
              personalizados:
            </li>
          </ul>

          <div class="org-src-container">
            <pre class="src src-emacs-lisp">
youtube-dl --sub-lang {{en}} --write -sub '{{https://www.youtube.com/watch?v=oHg5SJYRHA0}}'
</pre
            >
          </div>

          <ul class="org-ul">
            <li>
              Descargar lista de reproducción completa y extraer audio en
              formato mp3:
            </li>
          </ul>

          <pre class="example">
youtube-dl --extract-audio --audio-format mp3 -o "%(title)s.%(ext)s" &lt;url to playlist&gt;
</pre
          >

          <ul class="org-ul">
            <li>
              Lo mismo pero con mejor la mejor calidad de audio disponible e
              ignorando errores:
            </li>
          </ul>

          <pre class="example">
youtube-dl -f "bestaudio" --continue --no-overwrites --ignore-errors --extract-audio
 --audio-format mp3 -o "%(title)s.%(ext)s" {{url_to_playlist}}
</pre
          >
        </div>
      </div>
      <div class="taglist">
        <a href="https://martiyo.github.io/tags.html">Tags</a>:
        <a href="https://martiyo.github.io/tag-linux.html">linux</a>
      </div>
    </div>
    <div id="postamble" class="status">
      <div id="archive">
        <a href="https://martiyo.github.io/archive.html">Other posts</a>
      </div>
      <footer></footer>
    </div>
  </body>
</html>
